MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0564VG4AE/mcu.h
     * |        |          |Read this bit field to get SC_SCn_RST signal status.
     * |        |          |0 = SC_SCn_RST signal status is low.
     * |        |          |1 = SC_SCn_RST signal status is high.
     * |        |          |Note: When operating at activation, warm reset or deactivation mode, this bit will be changed automatically
     * |        |          |Thus, do not fill in this field when operating in these modes.[WH1]
     * |        |          |[WH1]Tag84
     * |[6]     |CLKKEEP   |SC Clock Enable Bit
     * |        |          |0 = SC clock generation Disabled.
     * |        |          |1 = SC clock always keeps free running.
     * |        |          |Note: When operating in activation, warm reset or deactivation mode, this bit will be changed automatically
     * |        |          |Thus, do not fill in this field when operating in these modes.[WH1]
     * |        |          |[WH1]Tag66
     * |[9]     |SCDATA    |SC_SCn_DATA Pin Signal
     * |        |          |This bit is the signal status of SC_SCn_DATA but user can also drive SC_SCn_DATA pin to high or low by control this setting this bit.
     * |        |          |Write this bit can drive SC_RST pin.
     * |        |          |0 = Drive SC_SCn_DATA pin to low.
     * |        |          |1 = Drive SC_SCn_DATA pin to high.
     * |        |          |Read this bit field to get SC_SCn_DATA signal status.
     * |        |          |0 = SC_SCn_DATA signal status is low.
     * |        |          |1 = SC_SCn_DATA signal status is high.
     * |        |          |Note: When SC is at activation, warm reset or deactivation mode, this bit will be changed automatically
     * |        |          |Thus, do not fill in this field when SC is in these modes.[WH1]
     * |        |          |[WH1]Tag85
     * |[11]    |PWRINV    |SC_SCn_PWR Pin Inverse
     * |        |          |This bit is used for inverse the SC_SCn_PWR pin.
     * |        |          |There are four kinds of combination for SC_SCn_PWR pin setting by PWRINV (SC_SCn_PINCTL[11]) and PWREN (SC_SCn_PINCTL[0])
     * |        |          |A
     * |        |          |PWRINV (SC_SCn_PINCTL[11]) is bit 1 and PWREN (SC_SCn_PINCTL[0]) is bit 0 and all conditions as below list.,
     * |        |          |00 = SC_SCn_PWR pin is 0.
     * |        |          |01 = SC_SCn_PWR pin is 1.
     * |        |          |10 = SC_SCn_PWR pin is 1.
     * |        |          |11 = SC_SCn_PWR pin is 0.
     * |        |          |Note: User must select PWRINV (SC_SCn_PINCTL[11]) before smart card is enabled by SCEN (SC_SCn_CTL[0]).[WH1]
     * |        |          |[WH1]Tag84
     * |[16]    |DATSTS    |SC_SCn_DATA Pin Status (Read Only)
     * |        |          |This bit is the pin status of SC_SCn_DATA.
     * |        |          |0 = The SC_SCn_DATA pin status is low.
     * |        |          |1 = The SC_SCn_DATA pin status is high.
     * |[17]    |PWRSTS    |SCn_PWR Pin Status (Read Only)
     * |        |          |This bit is the pin status of SC_SCn_PWR.
     * |        |          |0 = SC_SCn_PWR pin to low.
     * |        |          |1 = SC_SCn_PWR pin to high.[WH1]
     * |        |          |[WH1]Tag84
     * |[18]    |RSTSTS    |SC_SCn_RST Pin Status (Read Only)
     * |        |          |This bit is the pin status of SC_SCn_RST.
     * |        |          |0 = SC_SCn_RST pin is low.
     * |        |          |1 = SC_SCn_RST pin is high. [WH1]
     * |        |          |[WH1]Tag83
     * |[30]    |SYNC      |SYNC Flag Indicator (Read Only)
     * |        |          |Due to synchronization, user should check this bit when writing a new value to SC_SCn_PINCTL register.
     * |        |          |0 = Synchronizing is completion, user can write new data to SC_SCn_PINCTL register.
     * |        |          |1 = Last value is synchronizing. [WH1]
     * |        |          |[WH1]Tag82
     * @var SC_T::TMRCTL0
     * Offset: 0x28  SC Timer0 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |CNT       |Timer 0 Counter Value
     * |        |          |This field indicates the internal Timer0 counter values.
     * |        |          |Note: Unit of Timer01 counter is ETU base.[WH1]
     * |        |          |[WH1]Tag9, 37~49
     * |[27:24] |OPMODE    |Timer 0 Operation Mode Selection
     * |        |          |This field indicates the internal 824-bit Timer0 operation selection.
     * |        |          |Refer to Table 1.1-3 Table 1.1-3 for programming Timer0.[WH1]
     * |        |          |[WH1]Tag9, 37~49
     * |[31]    |SYNC      |SYNC Flag Indicator (Read Only)
     * |        |          |Due to synchronization, softwareuser should check this bit when writing a new value to SCn_TMRCTL0 register.
     * |        |          |0 = Synchronizing is completion, user can write new data to SCn_TMRCTL0 register.
     * |        |          |1 = Last value is synchronizing. [WH1]
     * |        |          |[WH1]Tag88
     * @var SC_T::TMRCTL1
     * Offset: 0x2C  SC Timer1 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CNT       |Timer 1 Counter Value
     * |        |          |This field indicates the internal Timer1 counter values.
     * |        |          |Note: Unit of Timer1 counter is ETU base.[WH1]
     * |        |          |[WH1]Tag9, 37~49
     * |[27:24] |OPMODE    |Timer 1 Operation Mode Selection
     * |        |          |This field indicates the internal 8-bit Timer1 operation selection.
     * |        |          |Refer to Table 1.1-3 Table 1.1-3 for programming Timer1.[WH1]
     * |        |          |[WH1]Tag9, 37~49
     * |[31]    |SYNC      |SYNC Flag Indicator (Read Only)
     * |        |          |Due to synchronization, softwareuser should check this bit when writing a new value to SCn_TMRCTL1 register.
     * |        |          |0 = Synchronizing is completion, user can write new data to SCn_TMRCTL1 register.
     * |        |          |1 = Last value is synchronizing. [WH1]
     * |        |          |[WH1]Tag88
     * @var SC_T::TMRCTL2
     * Offset: 0x30  SC Timer2 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CNT       |Timer 2 Counter Value
     * |        |          |This field indicates the internal Timer2 counter values.
     * |        |          |Note: Unit of Timer2 counter is ETU base.[WH1]
     * |        |          |[WH1]Tag9, 37~49
     * |[27:24] |OPMODE    |Timer 2 Operation Mode Selection
     * |        |          |This field indicates the internal 8-bit Timer2 operation selection
     * |        |          |Refer to Table 1.1-3 Table 1.1-3 for programming Timer2.[WH1]
     * |        |          |[WH1]Tag9, 37~49
     * |[31]    |SYNC      |SYNC Flag Indicator (Read Only)
     * |        |          |Due to synchronization, user should check this bit when writing a new value to SCn_TMRCTL2 register.
     * |        |          |0 = Synchronizing is completion, user can write new data to SCn_TMRCTL2 register.
     * |        |          |1 = Last value is synchronizing. [WH1]
     * |        |          |[WH1]Tag88
     * @var SC_T::UARTCTL
     * Offset: 0x34  SC UART Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |UARTEN    |UART Mode Enable Bit
     * |        |          |Sets this bit to enable UART mode function.
     * |        |          |0 = Smart Card mode.
     * |        |          |1 = UART mode.
     * |        |          |Note1: When operating in UART mode, user must set CONSEL (SC_SCn_CTL[5:4]) = 00 and AUTOCEN (SC_SCn_CTL[3]) = 0.
     * |        |          |Note2: When operating in Smart Card mode, user must set UARTEN (SC_SCn_UARTCTL[0]) = 0.
     * |        |          |Note3: When UART mode is enabled, hardware will generate a reset SC event to reset FIFO and internal state machine.[WH1]
     * |        |          |[WH1]Tag94
     * |[5:4]   |WLS       |Word Length Selection
     * |        |          |This field is used for select uart UART data transfer length.
     * |        |          |00 = Word length is 8 bits.
     * |        |          |01 = Word length is 7 bits.
     * |        |          |10 = Word length is 6 bits.
     * |        |          |11 = Word length is 5 bits.
     * |        |          |Note: In smart card mode, this WLS field must be u201800u2019.[WH1]
     * |        |          |[WH1]Tag93
     * |[6]     |PBOFF     |Parity Bit Disable Control
     * |        |          |Sets tThis bit is used for disable parity check function.
     * |        |          |0 = Parity bit is generated or checked between the u201Clast data word bitu201D and u201Cstop bitu201D of the serial data.
     * |        |          |1 = Parity bit is not generated (transmitting data) or checked (receiving data) during transfer.
     * |        |          |Note: In smart card mode, this field bit must be u20180u2019 (default setting is with parity bit)[WH1].
     * |        |          |[WH1]Tag21
     * |[7]     |OPE       |Odd Parity Enable Bit
     * |        |          |This is used for odd/even parity selection.
     * |        |          |0 = Even number of logic 1u2019s are transmitted or check the data word and parity bits in receiving mode.
     * |        |          |1 = Odd number of logic 1u2019s are transmitted or check the data word and parity bits in receiving mode.
     * |        |          |Note: This bit has effect only when PBOFF bit is u20180u2019.
     * @var SC_T::TMRDAT0
     * Offset: 0x38  SC Timer0 Current Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |CNT0      |Timer0 Current Data Value (Read Only)
     * |        |          |This field indicates the current counter values of Timer0.[WH1]
     * |        |          |[WH1]Tag37
     * @var SC_T::TMRDAT12
     * Offset: 0x3C  SC Timer1/2 Current Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CNT1      |Timer1 Current Data Value (Read Only)
     * |        |          |This field indicates the current counter values of Timer1.[WH1]
     * |        |          |[WH1]Tag37
     * |[15:8]  |CNT2      |Timer2 Current Data Value (Read Only)
     * |        |          |This field indicates the current counter values of Timer2.
     * @var SC_T::ACTCTL
     * Offset: 0x4C  SC Activation Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |T1EXT     |T1 Extend Time of Hardware Activation
     * |        |          |This field provide the configurable cycles to extend the activation time T1 period.
     * |        |          |Please refer to SC activation sequence in Figure 1.1-4.
     * |        |          |The cycle scaling factor is 2048 and .
     * |        |          |Extend cycles = (filled valueT1EXT * 2048) cycles.
     * |        |          |Refer to SC activation sequence in Figure 1.1-4 SC Activation Sequence.
     * |        |          |For example:,
     * |        |          |If SCLK is= 4MHz, each clock cycle cyiscle = 0.25us.,.
     * |        |          |Filled 20 to this T1EXT, thenfield
     * |        |          |Extend time == 20 * 2048 * 0.25us = 10.24 ms.
     * |        |          |Note: Setting 0 to this field conforms to the protocol ISO/IEC 7816-3[WH1].
     * |        |          |[WH1]Tag98
     */

